In [1]:
import numpy as np
import pandas as pd

In [3]:
ser1 = pd.Series([1,2,3,4],index = ['India', 'USA', 'Gambia', 'Jamaica'])

In [4]:
ser1

India      1
USA        2
Gambia     3
Jamaica    4
dtype: int64

In [7]:
np.random.seed(101)

In [9]:
from numpy.random import randn

In [53]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [11]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [18]:
type(df['W'])

pandas.core.series.Series

In [20]:
df.X

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [22]:
df[['Y','Z','X']]

          Y         Z         X
A  0.907969  0.503826  0.628133
B -0.848077  0.605965 -0.319318
C  0.528813 -0.589001  0.740122
D -0.933237  0.955057 -0.758872
E  2.605967  0.683509  1.978757

In [23]:
df['YZsum'] = df['Y'] + df['Z']

In [24]:
df

          W         X         Y         Z     YZsum
A  2.706850  0.628133  0.907969  0.503826  1.411795
B  0.651118 -0.319318 -0.848077  0.605965 -0.242112
C -2.018168  0.740122  0.528813 -0.589001 -0.060187
D  0.188695 -0.758872 -0.933237  0.955057  0.021819
E  0.190794  1.978757  2.605967  0.683509  3.289476

In [29]:
df.drop('YZsum',axis=1,inplace = True)

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.drop('D')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df.shape

(5, 4)

In [34]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [35]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.loc['B',['Y','Z']]

Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [39]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [44]:
x = pd.DataFrame(np.random.rand(3,3)*100,['A','B','C'],['X','Y','Z'])

In [45]:
x

           X          Y          Z
A  32.460800  11.757809   5.110100
B  63.765865  81.226589  67.026042
C  65.176770  42.456894  65.659534

In [50]:
x.loc['C']

X    65.176770
Y    42.456894
Z    65.659534
Name: C, dtype: float64

In [54]:
df

          W         X         Y         Z
A  0.616861 -1.121822  1.652070  0.196925
B  0.103214 -0.147370  1.131284  1.085839
C  0.449486 -0.002963 -0.648177 -0.956150
D  1.610461  1.319618 -0.363704  1.081731
E  1.775652  0.435743  1.194999  1.076547

In [55]:
df > 0

      W      X      Y      Z
A  True  False   True   True
B  True  False   True   True
C  True  False  False  False
D  True   True  False   True
E  True   True   True   True

In [56]:
booldf = df>0

In [57]:
df[booldf]

          W         X         Y         Z
A  0.616861       NaN  1.652070  0.196925
B  0.103214       NaN  1.131284  1.085839
C  0.449486       NaN       NaN       NaN
D  1.610461  1.319618       NaN  1.081731
E  1.775652  0.435743  1.194999  1.076547

In [58]:
df

          W         X         Y         Z
A  0.616861 -1.121822  1.652070  0.196925
B  0.103214 -0.147370  1.131284  1.085839
C  0.449486 -0.002963 -0.648177 -0.956150
D  1.610461  1.319618 -0.363704  1.081731
E  1.775652  0.435743  1.194999  1.076547

In [61]:
df['X'] > 0

A    False
B    False
C    False
D     True
E     True
Name: X, dtype: bool

In [60]:
df.loc['C'] > 0

W     True
X    False
Y    False
Z    False
Name: C, dtype: bool

In [62]:
df[df['X']>0]

          W         X         Y         Z
D  1.610461  1.319618 -0.363704  1.081731
E  1.775652  0.435743  1.194999  1.076547

In [63]:
df[df['Z']<0]

          W         X         Y        Z
C  0.449486 -0.002963 -0.648177 -0.95615

In [79]:
e = df[df['Y']>0]
e

          W         X         Y         Z
A  0.616861 -1.121822  1.652070  0.196925
B  0.103214 -0.147370  1.131284  1.085839
E  1.775652  0.435743  1.194999  1.076547

In [83]:
e.loc[['A','E']]

          W         X         Y         Z
A  0.616861 -1.121822  1.652070  0.196925
E  1.775652  0.435743  1.194999  1.076547

In [86]:
df[df['Y']>0].loc[['A','E'],['X','Z']]

          X         Z
A -1.121822  0.196925
E  0.435743  1.076547

In [87]:
df[(df['X']>0) & (df['Z']>0)]

          W         X         Y         Z
D  1.610461  1.319618 -0.363704  1.081731
E  1.775652  0.435743  1.194999  1.076547

In [88]:
newind = 'BR JH MH DL UP'.split()

In [90]:
df['States'] = newind

In [91]:
df

          W         X         Y         Z States
A  0.616861 -1.121822  1.652070  0.196925     BR
B  0.103214 -0.147370  1.131284  1.085839     JH
C  0.449486 -0.002963 -0.648177 -0.956150     MH
D  1.610461  1.319618 -0.363704  1.081731     DL
E  1.775652  0.435743  1.194999  1.076547     UP

In [92]:
df.set_index('States')

               W         X         Y         Z
States
BR      0.616861 -1.121822  1.652070  0.196925
JH      0.103214 -0.147370  1.131284  1.085839
MH      0.449486 -0.002963 -0.648177 -0.956150
DL      1.610461  1.319618 -0.363704  1.081731
UP      1.775652  0.435743  1.194999  1.076547

In [101]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [102]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [105]:
df = pd.DataFrame(randn(6,3), hier_index, ['A','B','C'])

In [106]:
df

             A         B         C
G1 1  0.539118  0.669774 -1.270484
   2 -0.446181  0.779475  0.479900
   3 -0.960697 -2.002399 -1.263599
G2 1 -0.696232 -1.148220  1.607435
   2 -1.226870  1.405532 -1.137201
   3 -0.535478  2.142717  1.691452

In [112]:
df.loc['G1']['A']

1    0.539118
2   -0.446181
3   -0.960697
Name: A, dtype: float64

In [115]:
df.loc['G2'].loc[2,'B']

1.405531890890817

In [116]:
df

             A         B         C
G1 1  0.539118  0.669774 -1.270484
   2 -0.446181  0.779475  0.479900
   3 -0.960697 -2.002399 -1.263599
G2 1 -0.696232 -1.148220  1.607435
   2 -1.226870  1.405532 -1.137201
   3 -0.535478  2.142717  1.691452

In [117]:
df.xs('G1')

          A         B         C
1  0.539118  0.669774 -1.270484
2 -0.446181  0.779475  0.479900
3 -0.960697 -2.002399 -1.263599

In [121]:
df.index.names = ['Groups','Num']

In [122]:
df

                   A         B         C
Groups Num
G1     1    0.539118  0.669774 -1.270484
       2   -0.446181  0.779475  0.479900
       3   -0.960697 -2.002399 -1.263599
G2     1   -0.696232 -1.148220  1.607435
       2   -1.226870  1.405532 -1.137201
       3   -0.535478  2.142717  1.691452

In [123]:
df.xs(1, level = 'Num')

               A         B         C
Groups
G1      0.539118  0.669774 -1.270484
G2     -0.696232 -1.148220  1.607435

In [2]:
2+2

4

In [3]:
import numpy as np, pandas as pd

In [4]:
d = {'A':[1,2,np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]}

In [5]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [6]:
df = pd.DataFrame(d)

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [10]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [13]:
df.dropna(thresh = 2) #Row mein atleast 2 value (non NaN) hona hi chahiye

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [14]:
df.fillna(value = 'Yahan NaN tha')

               A              B  C
0              1              5  1
1              2  Yahan NaN tha  2
2  Yahan NaN tha  Yahan NaN tha  3

In [16]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [17]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [19]:
df = pd.DataFrame(data)

In [20]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [21]:
byComp = df.groupby('Company')

In [22]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [24]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [31]:
df.groupby('Company').std().loc['GOOG']

Sales    56.568542
Name: GOOG, dtype: float64

In [32]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [35]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [2]:
import pandas as pd, numpy as np

In [5]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [6]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [7]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [8]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [10]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [11]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [12]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [13]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [14]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [17]:
pd.merge(left, right, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [18]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [20]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [21]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [22]:
pd.merge(left, right, on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [25]:
pd.merge(left, right, how = 'outer', on = ['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [26]:
pd.merge(left, right, how = 'right', on = ['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [27]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [28]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [29]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [30]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [31]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [38]:
from pandasql import sqldf

In [39]:
import pandasql as ps

df = pd.DataFrame([[1234, 'Customer A', '123 Street', np.nan],
               [1234, 'Customer A', np.nan, '333 Street'],
               [1233, 'Customer B', '444 Street', '333 Street'],
              [1233, 'Customer B', '444 Street', '666 Street']], columns=
['ID', 'Customer', 'Billing Address', 'Shipping Address'])

In [40]:
df

     ID    Customer Billing Address Shipping Address
0  1234  Customer A      123 Street              NaN
1  1234  Customer A             NaN       333 Street
2  1233  Customer B      444 Street       333 Street
3  1233  Customer B      444 Street       666 Street

ps.sqldf("select Customer from df")

In [49]:
ps.sqldf("select * from left union select * from df2")

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [47]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [72]:
email = 'Turing Machine, logic@247 | Sycamore_5GHz, logic@24X7 | admin, gponaccess'
email_list = list(email)
email_dict = {k:v for k, v in enumerate(email_list)}
shuffled_email_dict = dict(sorted(email_dict.items(), key=lambda x: random()))

scrambled_email = ''.join(shuffled_email_dict.values())
scrambled_email_indices = list(shuffled_email_dict.keys())

print(scrambled_email)
print(scrambled_email_indices)

huici5nz7H,ro4o 4 mrc i@a, Gc2XlcmncdsynlieapT@ogngeM  |7e|,s_ig c2 aoaSg
[10, 1, 11, 47, 19, 37, 66, 40, 52, 39, 14, 34, 65, 23, 44, 53, 50, 25, 58, 2, 68, 62, 59, 48, 56, 41, 42, 38, 20, 49, 51, 16, 9, 32, 4, 30, 57, 71, 29, 12, 43, 46, 13, 8, 64, 0, 21, 17, 45, 60, 18, 70, 7, 15, 6, 26, 24, 35, 54, 61, 72, 36, 3, 5, 27, 69, 22, 55, 31, 33, 67, 28, 63]

In [73]:
import pandas as pd, numpy as np

In [74]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [76]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [83]:
df['col2'].nunique()

3

In [86]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [90]:
df[(df['col1']>2) & (df['col2']>500) ]

   col1  col2 col3
2     3   666  ghi

In [91]:
def times3(x):
    return x*3

In [101]:
df['col3'].apply(times3)

0    abcabcabc
1    defdefdef
2    ghighighi
3    xyzxyzxyz
Name: col3, dtype: object

In [107]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [111]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [110]:
df.drop('col2', axis = 1)

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [115]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [116]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [118]:
df.sort_values('col2', ascending = False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [119]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [120]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [121]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [122]:
df.pivot_table(values = 'D', index = ['A','B'],columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [123]:
import os

In [125]:
os.getcwd()

'C:\\Users\\User\\Desktop\\Financial Analysis - Jose Portilla\\Python-for-Finance-Repo-master\\03- General Pandas'

In [126]:
df = pd.read_csv('example')

In [127]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [129]:
os.listdir()

['.ipynb_checkpoints',
 '01-Introduction-to-Pandas.ipynb',
 '02-Series.ipynb',
 '03-DataFrames.ipynb',
 '04-Missing-Data.ipynb',
 '05-Groupby.ipynb',
 '06-Merging-Joining-and-Concatenating.ipynb',
 '07-Operations.ipynb',
 '08-Data-Input-and-Output.ipynb',
 'example',
 'Excel_Sample.xlsx',
 'multi_index_example',
 'Pandas-Exercises',
 'Untitled.ipynb']

In [16]:
df = pd.read_excel('Excel_Sample.xlsx', sheet_name = 'Sheet1', index_col = 0)

In [3]:
import pandas as pd, numpy as np

In [17]:
df.to_excel('NewSample.xlsx',sheet_name = 'Naya_Sheet')

In [18]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [23]:
data[0].to_excel('FDIC_data.xlsx')

In [25]:
data[0].head(10)

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
5,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019",10533
6,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
7,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019",10531
8,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017",10530
9,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017",10529

In [29]:
from sqlalchemy import create_engine

In [30]:
engine = create_engine('sqlite:///:memory:')

In [32]:
type(engine)

sqlalchemy.engine.base.Engine

In [33]:
data[0].to_sql('my_fdic_table', engine)

In [34]:
sqldf = pd.read_sql('my_fdic_table', con = engine)

In [40]:
sqldf

,index,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...,...
558,558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645